tutorials/compressible/nexaFoam/neTCLib/heatBath_case4/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heNe2TReactionThermo;
    mixture         neReactingMixture;
    transport       blottnerEucken2T;
    thermo          janaf2T;
    equationOfState perfect2TGas;
    specie          specie2T;
    energy          sensibleCalculation2T;
}

twoTemperature      true;
VVrelaxation        false;
chemistry           true;

chemistryReader     foamNeChemistryReader;

CVTreatment         preferential; //non-preferential;
alphaDissociation   0.3;

reactionsList           "<constant>/reactionsDict";
speciesList             "<constant>/speciesDict";

KnabVVCoefficients
{
    // Fallback for any pair not explicitly listed
    default
    {
        sigma12     1.5e-18;   // m²
        P21         0.01;
    }

    // Species-pair specific overrides (name1_name2 or name2_name1, both checked)
    N2_O2
    {
        sigma12     2.667e-19;
        P21         0.01;
    }

    N2_NO
    {
        sigma12     2.751e-19;
        P21         0.01;
    }

    O2_NO
    {
        sigma12     2.686e-19;
        P21         0.01;
    }
}

// ************************************************************************* //
